% «адача о потоке минимальной стоимости
C = [0, 1, 0, 0, 0, 0;
    0, 0, 0, 0, 0, 3;
    0, 3, 0, 5, 0, 0;
    0, 0, 0, 0, 0, 0;
    0, 0, 4, 1, 0, 0;
    -2, 0, 3, 0, 4, 0]; % стоимости
a = [1, -4, -5, -6, 5, 9]; % исток / сток
X = [0, 1, 0, 0, 0, 0;
    0, 0, 0, 0, 0, 0;
    0, 3, 0, 1, 0, 0;
    0, 0, 0, 0, 0, 0;
    0, 0, 0, 5, 0, 0;
    0, 0, 9, 0, 0, 0];

% ѕодсчитать потенциалы базисных узлов
E = C ~= 0;
B = X > 0;

[X, c] = mcmf(C, a, X, B, E);

%% Run tests
result = run(McmfTest);
disp(result);